<!DOCTYPE html>
<html lang="en">
  <head>
    <meta name="description" content="Apache AGE - PostgreSQL extension for graph database functionality" />
    <meta name="theme-color" content="#ffffff" />
    <meta name="viewport" content="width=device-width, initial-scale=1.0" />

    <link rel="stylesheet" href="assets/styles/index.css" />
    <link rel="apple-touch-icon" sizes="180x180" href="assets/images/favicon/apple-touch-icon.png" />
    <link rel="icon" type="image/png" sizes="32x32" href="assets/images/favicon/favicon-32x32.png" />
    <link rel="icon" type="image/png" sizes="16x16" href="assets/images/favicon/favicon-16x16.png" />

    <title>Apache AGE - PostgreSQL extension for graph database functionality</title>

    <script type="text/javascript" src="assets/scripts/index.js"></script>
  </head>

  <body>
    <div class="root">
      <div class="header">
        <img src="assets/images/logo.png" width="250px" />
        <div class="header--title">A Graph Extension for PostgreSQL</div>
        <div class="header--hamburger" id="menu" onclick="handleMenuClick(this)">
          <div class="header--hamburger-div"></div>
          <div class="header--hamburger-div"></div>
          <div class="header--hamburger-div"></div>
        </div>
      </div>

      <div class="sidebar" id="sidebar">
        <p class="sidebar--section">
          <span class="emph">APACHE AGE</span><br />
          <span id="sidebar-overview" class="sidebar-item sidebar--selected"> <a class="sidebar-link" href="#" onclick="handleClick(this)">Overview</a></span> <br />
          <!-- FAQs <br /> -->
          <span id="sidebar-license" class="sidebar-item"> <a class="sidebar-link" href="#" onclick="handleClick(this)">License</a></span> <br />
          <!-- Downloads <br /> -->
          <span id="sidebar-roadmap" class="sidebar-item"> <a class="sidebar-link" href="#" onclick="handleClick(this)">Roadmap</a></span> <br />
        </p>

        <p class="sidebar--section">
          <span class="emph">DOCUMENTATION</span> <br />
          <span id="sidebar-installing" class="sidebar-item"> <a class="sidebar-link" href="#" onclick="handleClick(this)">Installing AGE</a></span> <br />
          <span id="sidebar-gettingstarted" class="sidebar-item"> <a class="sidebar-link" href="#" onclick="handleClick(this)">Getting Started</a></span> <br />
          <span id="sidebar-docs" class="sidebar-item"> <a target="_blank" class="sidebar-link" href="docs/">Full Documentation</a></span> <br />
        </p>

        <p class="sidebar--section">
          <span class="emph">CONTRIBUTION</span> <br />
          <span id="sidebar-contribute" class="sidebar-item"> <a class="sidebar-link" href="#" onclick="handleClick(this)">How to Contribute</a></span> <br />          
          Coding Guideline <br />
        </p>

        <p class="sidebar--section">
          <span class="emph">COMMUNITY</span> <br />
          <span id="sidebar-team" class="sidebar-item"> <a class="sidebar-link" href="#" onclick="handleClick(this)">Team</a></span> <br />          
          <span id="sidebar-mailinglists" class="sidebar-item"> <a class="sidebar-link" href="#" onclick="handleClick(this)">Mailing Lists</a></span> <br />          
          <a class="sidebar-link external-link" target="_blank" href="https://issues.apache.org/jira/projects/AGE/issues">Issue Tracker</a> <br />
          <a class="sidebar-link external-link" target="_blank" href="https://github.com/apache/incubator-age">Github</a> <br />
        </p>

        <p class="sidebar--section">
          <span class="emph">ASF</span> <br />
          <a class="sidebar-link external-link" target="_blank" href="https://www.apache.org/foundation/">Apache Software Foundation</a> <br />
          <a class="sidebar-link external-link" target="_blank" href="https://www.apache.org/foundation/how-it-works.html">How Apache Works</a> <br />
          <a class="sidebar-link external-link" target="_blank" href="https://www.apache.org/foundation/sponsorship.html">Sponsorship</a> <br />
          <a class="sidebar-link external-link" target="_blank" href="https://www.apache.org/foundation/thanks.html">Thanks</a> <br />
        </p>
      </div>

      <div class="main">
        <!-- 
          *
          * AGE 
          *
        -->
        <div class="main-item main--selected" id="main-overview">
          <div class="title">Apache AGE (Incubating)</div>
          <div class="main-body">
            <p class="main-content">
              Apache AGE a PostgreSQL extension that provides graph database functionality. AGE is an acronym for AgensGraph Extension, and is inspired by Bitnine's fork of
              PostgreSQL 10, AgensGraph, which is a multi-model database. The goal of the project is to create single storage that can handle both relational and graph model data
              so that users can use standard ANSI SQL along with openCypher, the Graph query language.
            </p>

            <div class="subtitle">Features</div>
            <ul>              
              <li> PostgreSQL version AGE supports</li>
              <li> openCypher ... version AGE supports  </li>
              <li> Multi-graph ... brief explanation </li>
              <li> Label inheritance ... brief explanation  </li>
              <li> Aggregation ... brief explanation </li>
            </ul>

            <div class="subtitle">News & Updates</div>
            <ul>
              <li>2020-12-1
                <ul>
                  <li>Redesigned page</li>
                  <li>New releases</li>
                </ul>

              </li>
            </ul>
          </div>
        </div>
        <div class="main-item" id="main-license">
          <div class="title">License</div>
          <div class="main-body">Apache AGE is licensed under <a target="_blank" href="http://www.apache.org/licenses/LICENSE-2.0.html">Apache License, version 2.0</a></div>
        </div>
        <div class="main-item" id="main-roadmap">
          <div class="title">Roadmap</div>
          <div class="main-body">here is the roadmap</div>
        </div>

        <!-- 
          *
          * DOCUMENTATION 
          *
        -->
        <div class="main-item" id="main-installing">
          <div class="title">Installing AGE</div>
          <div class="subtitle">Using Docker</div>
          <div class="main-body">
            Docker images are available on Docker Hub and are based on the official PostgreSQL 11 Debian and Alpine images. <br />
            <ul>
              <li><a class="external-link" target="_blank" href="https://hub.docker.com/r/sorrell/agensgraph-extension">AGE Debian Docker Image</a></li>
              <li><a class="external-link" target="_blank" href="https://hub.docker.com/r/sorrell/agensgraph-extension-alpine">AGE Alpine Docker Image</a></li>
            </ul>
          </div>
          <div class="subtitle">Installing from source</div>
          <div class="main-body">
            Building AGE from source depends on the following Linux libraries (Ubuntu package names shown below):

            <div class="code">$ sudo apt-get install bison build-essential flex postgresql-server-dev-11</div>

            The build process will attempt to use the first path in the PATH environment variable when installing AGE. If the pg_config path if located there, run the following
            command in the source code directory of Apache AGE to build and install the extension.

            <div class="code">$ make install</div>

            If the path to your Postgres installation is not in the PATH variable, add the path in the arguements:

            <div class="code">$ make PG_CONFIG=/path/to/postgres/bin/pg_config install</div>

            Since Apache AGE will be installed in the directory of the PostgreSQL installation, proper permissions on the directory are required. Run the following statements in
            psql to create and load age in PostgreSQL.

            <div class="code">=# CREATE EXTENSION age; -- run this statement only once
CREATE EXTENSION
=# LOAD 'age'; 
LOAD 
=# SET search_path = ag_catalog, "$user", public; 
SET
            </div>
          </div>
        </div>
        <div class="main-item" id="main-gettingstarted">
          <div class="title">Getting Started</div>
          <div class="main-body">
            <div class="subtitle">Loading AGE</div>
            Connect to your containerized Postgres instance and then run the following commands:

            <div class="code">
CREATE EXTENSION age;
LOAD 'age';
SET search_path = ag_catalog, "$user", public;
            </div>
            
            <div class="subtitle">Using AGE</div>
            First you will need to create a graph:

            <div class="code">
SELECT create_graph('my_graph_name');
            </div>

            To execute Cypher queries, you will need to wrap them in the following syntax:

            <div class="code">
SELECT * from cypher('my_graph_name', $$
  CypherQuery
$$) as (a agtype);
            </div>

            For example, if we wanted to create a graph with 4 nodes, we could do something as shown below:

            <div class="code">
SELECT * from cypher('my_graph_name', $$
  CREATE (a:Part {part_num: '123'}), 
        (b:Part {part_num: '345'}), 
        (c:Part {part_num: '456'}), 
        (d:Part {part_num: '789'})
$$) as (a agtype);

--- RESULTS
a
---
(0 rows)
            </div>

            Then we could query the graph with the following:

            <div class="code">
SELECT * from cypher('my_graph_name', $$
  MATCH (a)
  RETURN a
$$) as (a agtype);

--- RESULTS
                                          a
-------------------------------------------------------------------------------------
{"id": 844424930131969, "label": "Part", "properties": {"part_num": "123"}}::vertex
{"id": 844424930131970, "label": "Part", "properties": {"part_num": "345"}}::vertex
{"id": 844424930131971, "label": "Part", "properties": {"part_num": "456"}}::vertex
{"id": 844424930131972, "label": "Part", "properties": {"part_num": "789"}}::vertex
(4 rows)
            </div>

            Next, we could create a relationship between a couple of nodes:

            <div class="code">
SELECT * from cypher('my_graph_name', $$
  MATCH (a:Part {part_num: '123'}), (b:Part {part_num: '345'})
  CREATE (a)-[u:used_by { quantity: 1 }]->(b)
$$) as (a agtype);

--- RESULTS
a
---
(0 rows)
            </div>

            Next we can return the path we just created (results have been formatted for readability):
            
            <div class="code">
SELECT * from cypher('age', $$
  MATCH p=(a)-[]-(b)
  RETURN p
$$) as (a agtype);

// RESULTS
// ROW 1
[
  {
      "id":844424930131969,
      "label":"Part",
      "properties":{
        "part_num":"123"
      }
  }::"vertex",
  {
      "id":1125899906842625,
      "label":"used_by",
      "end_id":844424930131970,
      "start_id":844424930131969,
      "properties":{
        "quantity":1
      }
  }::"edge",
  {
      "id":844424930131970,
      "label":"Part",
      "properties":{
        "part_num":"345"
      }
  }::"vertex"
]::"path"
// ROW 2
[
  {
      "id":844424930131970,
      "label":"Part",
      "properties":{
        "part_num":"345"
      }
  }::"vertex",
  {
      "id":1125899906842625,
      "label":"used_by",
      "end_id":844424930131970,
      "start_id":844424930131969,
      "properties":{
        "quantity":1
      }
  }::"edge",
  {
      "id":844424930131969,
      "label":"Part",
      "properties":{
        "part_num":"123"
      }
  }::"vertex"
]::"path"
(2 rows)
            </div>

          </div>
        </div>

         <!-- 
          *
          * CONTRIBUTION 
          *
        -->
        <div class="main-item" id="main-contribute">
          <div class="title">
            How to contribute
          </div>
          <div class="main-body">
            There are multiple ways you can contribute to the project.And help is always welcome! All details can be 
            found on the contributing page. Keep reading for a quick overview!
  
            <div class="subtitle">
              Becoming a Commiter
            </div>
            If you are interested in the project and looking for ways to help, consult the list of tasks in JIRA, or ask the mailing list.
  
  
            <div class="subtitle">
              Contributing by Helping Other Users
            </div>
            A great way to contribute to AGE is to help answer user questions on the TODO_LINK:mailing list or on TODO_LINK:StackOverflow. 
            There are always many new AGE users; taking a few minutes to help answer a question is a very valuable community service.
            <br>
            Contributors should subscribe to this list and follow it to keep up to date on what's happening in AGE. Answering 
            questions is an excellent and visible way to help the community, which also demonstrates your expertise.
            <br>
            See the Mailing Lists guide for guidelines about how to effectively participate in discussions on the mailing list, 
            as well as forums like StackOverflow.
  
  
            <div class="subtitle">
              Contributing by Reviewing Changes
            </div>
            Changes to AGE source code are proposed, reviewed, and committed via Github pull requests (described in Instruction Link). 
            Anyone can view and comment on active changes here. Reviewing others' changes is a good way to learn how the change process works 
            and gain exposure to activity in various parts of the code. You can help by reviewing the changes and asking questions 
            or pointing out issues as simple as typos or small issues of style.
  
  
            <div class="subtitle">
              Contributing Documentation Changes
            </div>
            To propose a change to release documentation (that is, docs that appear under TODO_LINK:https://AGE.apache.org/instruction/), 
            edit the Markdown source files in AGE's <span class="inline-code">docs/</span> directory on GitHub, whose README file shows how to 
            build the documentation locally to test your changes. The process to propose a doc change is otherwise the same as the 
            process for proposing code changes below.
  
  
            <div class="subtitle">
              Contributing Bug Reports
            </div>
            Ideally, bug reports are accompanied by a proposed code change to fix the bug. This isn't always possible, as those who discover a 
            bug may not have the experience to fix it. A bug may be reported by creating a JIRA issue but without creating a pull request.
            <br>
            Bug reports are only useful, however, if they include enough information to understand, isolate and ideally reproduce the bug. 
            Simply encountering an error does not mean a bug should be reported; search JIRA and inquire on the AGE user / dev mailing 
            lists first. Unreproducible bugs, or simple error reports, may be closed.
            <br>
            The more context the reporter can give about a bug, the better, such as: how the bug was introduced, by which 
            commit, etc. It assists the committers in the decision process on how far the bug fix should be backported, 
            when the pull request is merged. The pull request to fix the bug should narrow down the problem to the root cause.
            <br>
            Data correctness/data loss bugs are very serious. Make sure the corresponding bug report JIRA issue is labeled 
            as correctness or data-loss. Please send an email to <a href="mailto:dev@age.apache.org">dev@age.apache.org</a> after submitting 
            the bug report, to quickly draw attention to the issue.
            <br>
            Performance issues are classified as bugs. The pull request to fix a performance bug must provide a benchmark 
            to prove the problem is indeed fixed.

  
            <div class="subtitle">
              Contributing to JIRA Maintenance
            </div>
            Most contributors can directly resolve JIRA issues. Use judgment in determining whether you are confident the issue should be 
            resolved (although changes can be easily undone).
            <br> 
            When resolving JIRA tickets, please observe the following conventions:
            <ul>
              <li>
                Resolve as Fixed if there's a release or code commit that resolved the issue.
                <ul>
                  <li>
                    Set Fix Version(s), if and only if the resolution is Fixeds
                  </li>
                  <li>
                    Set Assignee to the person who contributed the most to its resolution, usually the person who opened the PR that resolved the issue.
                  </li>
                </ul>
              </li>
              <li>
                For issues that can't be reproduced against master as reported, resolve as Cannot Reproduce.
              </li>
              <li>
                If the issue is the same as or a subset of another issue, resolved as Duplicate
                <ul>
                  <li>
                    Mark the issue that has less activity or discussion as the duplicate.
                  </li>
                  <li>
                    Link it to the JIRA ticket it duplicates.
                  </li>
                </ul>
              </li>
              <li>
                If the issue seems clearly obsolete and applies to issues or components that have changed radically since it was opened, resolve as Not a Problem
              </li>
              <li>
                If the issue doesn't make sense or is not actionable resolve as Invalid.
              </li>
              <li>
                If it's a coherent issue, but there is a clear indication that there is not support or interest in acting on it, then resolve as Won't Fix.
              </li>
            </ul>
            <br>
            <span class="emph">Searching JIRA</span>
            How to search JIRA for existing issues:
            <ol>
              <li><span class="emph">Basic:</span>
                <ol>
                  <li>Visit <a href="https://issues.apache.org/jira/projects/AGE/issues">AGE JIRA</a></li>
                  <li>Type query into search box in top right (beware this will return results from all projects)</li>
                </ol>
              </li>
              <li>
                <span class="emph">Advanced: </span>
                <ol>
                  <li>Visit <a href="https://issues.apache.org/jira/issues/?jql=(project%3DAGE)%20and%20text%20~%20%22%22">AGE JIRA Advanced Search</a></li>
                  <li>Replace the empty quotes with quoted text (such as "cypher")</li>
                </ol>
              </li>
              <li>
                <span class="emph">Search Now:</span>
                <ol>
                  <li>Use the search box below</li>
                  <li><input class="search" id="jira-search" placeholder="search term"><button class="search" id="jira-submit" onclick="handleJiraSearch()">Search</button></li>
                </ol>
                
              </li>
            </ol> 
            If a logically similar issue already exists, then contribute to the discussion on the existing JIRA ticket and pull request, instead of creating a new ticket and PR.
          </div>
        </div>

        <!-- 
          *
          * COMMUNITY 
          *
        -->
        <div class="main-item" id="main-mailinglists">
          <div class="title">Mailing Lists</div>
          <div class="main-body">
            Get help using Apache AGE (Incubating) or contribute to the project on our mailing lists:

            <ul>
              <li>
                Visit <a target="_blank" class="external-link" href="https://lists.apache.org/list.html?commits@age.apache.org">
                  Commits</a> 
                  or <a class="mail-link" href="mailto:commits-subscribe@age.apache.org">subscribe</a>
                  for people following commits to the project.
              </li>
              <li>
                Visit <a target="_blank" class="external-link" href="https://lists.apache.org/list.html?dev@age.apache.org">
                  Developer</a> 
                  or <a class="mail-link" href="mailto:dev-subscribe@age.apache.org">subscribe</a>
                  for developers wanting to commit code to the project.
              </li>
              <li>
                Visit <a target="_blank" class="external-link" href="https://lists.apache.org/list.html?users@age.apache.org">
                  Users</a> 
                  or <a class="mail-link" href="mailto:users-subscribe@age.apache.org">subscribe</a>
                  for users wanting to learn more about the project.
              </li>
            </ul>
          </div>
        </div>

        <div class="main-item" id="main-team">
          <div class="title">Apache AGE Team Members</div>
          <div class="main-body">
            <div class="subtitle center">✪ Champions and Mentors ✪</div>
            <table class="center">
              <thead>
                <tr><th scope="col">Name</th><th scope="col">Email</th></tr>
              </thead>
              <tbody>
                <tr><td>Raphael Bircher</td>	<td>rbircher at apache dot org</td></tr>
                <tr><td>Von Gosling</td>	<td>vongosling at apachedot org</td></tr>
                <tr><td>Jim Jagielski</td>	<td>jim at apache dot org </td></tr>
                <tr><td>Kevin Ratnasekera</td>	<td>kevin at agsft dot com</td></tr>
              </tbody>
            </table>
            <div class="subtitle center">✰ Committers ✰</div>
            <p class="center">AGE's active Committers are (sorted on lastname in alphabetical order):</p>
            <table class="center">
              <thead>
                <tr><th scope="col">Name</th><th scope="col">Email</th></tr>
              </thead>
              <tbody>
                <tr><td>Jasper Blues</td>	<td>jasper at liberation dash data dot com</td></tr>
                <tr><td>John Gemignani</td>	<td>john dot gemignani at bitnine dot net</td></tr>
                <tr><td>Josh Innis</td>	<td>josh dot innis at bitnine dot net</td></tr>
                <tr><td>Mason Sharp</td>	<td>mason dot sharp at gmail dot com</td></tr>
                <tr><td>Junseok Yang</td>	<td>jsyang at bitnine dot net</td></tr>
              </tbody>
            </table>


          </div>
        </div>
      </div>

    </div>
    <div class="footer">
      <hr>
      <img class="footer-img" src="assets/images/incubator_ring_logo.png"> <br>
      <p class="center">Copyright © 2020 The Apache Software Foundation.Apache and the Apache feather logo are trademarks of The Apache Software Foundation</p>
    </div>
  </body>
</html>
