LOAD 'age';
SET search_path TO ag_catalog;
SELECT * FROM create_graph('subquery');
NOTICE:  graph "subquery" has been created
 create_graph 
--------------
 
(1 row)

SELECT * FROM cypher('subquery', $$
								   CREATE (:person {name: "Briggite", age: 32})-[:knows]->(:person {name: "Takeshi", age: 28}),
										  (:person {name: "Faye", age: 25})-[:knows]->(:person {name: "Tony", age: 34})-[:loved]->(:person {name : "Valerie", age: 33}),
										  (:person {name: "Calvin", age: 6})-[:knows]->(:pet {name: "Hobbes"}),
										  (:person {name: "Charlie", age: 8})-[:knows]->(:pet {name : "Snoopy"})
								 $$) AS (result agtype);
 result 
--------
(0 rows)

SELECT * FROM cypher('subquery', $$ MATCH (a) RETURN (a) $$) AS (result agtype);
                                              result                                               
---------------------------------------------------------------------------------------------------
 {"id": 844424930131969, "label": "person", "properties": {"age": 32, "name": "Briggite"}}::vertex
 {"id": 844424930131970, "label": "person", "properties": {"age": 28, "name": "Takeshi"}}::vertex
 {"id": 844424930131971, "label": "person", "properties": {"age": 25, "name": "Faye"}}::vertex
 {"id": 844424930131972, "label": "person", "properties": {"age": 34, "name": "Tony"}}::vertex
 {"id": 844424930131973, "label": "person", "properties": {"age": 33, "name": "Valerie"}}::vertex
 {"id": 844424930131974, "label": "person", "properties": {"age": 6, "name": "Calvin"}}::vertex
 {"id": 844424930131975, "label": "person", "properties": {"age": 8, "name": "Charlie"}}::vertex
 {"id": 1688849860263937, "label": "pet", "properties": {"name": "Hobbes"}}::vertex
 {"id": 1688849860263938, "label": "pet", "properties": {"name": "Snoopy"}}::vertex
(9 rows)

SELECT * FROM cypher('subquery', $$ MATCH (a:person)
									WHERE EXISTS {(a:person)-[]->(:pet)}
									RETURN (a) $$) AS (result agtype);
                                              result                                               
---------------------------------------------------------------------------------------------------
 {"id": 844424930131969, "label": "person", "properties": {"age": 32, "name": "Briggite"}}::vertex
 {"id": 844424930131970, "label": "person", "properties": {"age": 28, "name": "Takeshi"}}::vertex
 {"id": 844424930131971, "label": "person", "properties": {"age": 25, "name": "Faye"}}::vertex
 {"id": 844424930131972, "label": "person", "properties": {"age": 34, "name": "Tony"}}::vertex
 {"id": 844424930131973, "label": "person", "properties": {"age": 33, "name": "Valerie"}}::vertex
 {"id": 844424930131974, "label": "person", "properties": {"age": 6, "name": "Calvin"}}::vertex
 {"id": 844424930131975, "label": "person", "properties": {"age": 8, "name": "Charlie"}}::vertex
(7 rows)

--trying to use b when not defined, should fail
SELECT * FROM cypher('subquery', $$ MATCH (a:person)
										   WHERE EXISTS {(a:person)-[]->(b:pet)}
										   RETURN (a) $$) AS (result agtype);
                                              result                                               
---------------------------------------------------------------------------------------------------
 {"id": 844424930131969, "label": "person", "properties": {"age": 32, "name": "Briggite"}}::vertex
 {"id": 844424930131970, "label": "person", "properties": {"age": 28, "name": "Takeshi"}}::vertex
 {"id": 844424930131971, "label": "person", "properties": {"age": 25, "name": "Faye"}}::vertex
 {"id": 844424930131972, "label": "person", "properties": {"age": 34, "name": "Tony"}}::vertex
 {"id": 844424930131973, "label": "person", "properties": {"age": 33, "name": "Valerie"}}::vertex
 {"id": 844424930131974, "label": "person", "properties": {"age": 6, "name": "Calvin"}}::vertex
 {"id": 844424930131975, "label": "person", "properties": {"age": 8, "name": "Charlie"}}::vertex
(7 rows)

--query inside
--EXISTS subquery is currently implemented with postgres subqueries, which do not
--constrain the outer query results. the results of this regression test may change
--upon implementation
--TODO: implement inner subquery constraints
SELECT * FROM cypher('subquery', $$ MATCH (a:person)
									WHERE EXISTS {MATCH (a:person)-[]->(b:pet) RETURN b}
									RETURN (a) $$) AS (result agtype);
                                              result                                               
---------------------------------------------------------------------------------------------------
 {"id": 844424930131969, "label": "person", "properties": {"age": 32, "name": "Briggite"}}::vertex
 {"id": 844424930131970, "label": "person", "properties": {"age": 28, "name": "Takeshi"}}::vertex
 {"id": 844424930131971, "label": "person", "properties": {"age": 25, "name": "Faye"}}::vertex
 {"id": 844424930131972, "label": "person", "properties": {"age": 34, "name": "Tony"}}::vertex
 {"id": 844424930131973, "label": "person", "properties": {"age": 33, "name": "Valerie"}}::vertex
 {"id": 844424930131974, "label": "person", "properties": {"age": 6, "name": "Calvin"}}::vertex
 {"id": 844424930131975, "label": "person", "properties": {"age": 8, "name": "Charlie"}}::vertex
(7 rows)

--repeat variable in match
--EXISTS subquery is currently implemented with postgres subqueries, which do not
--constrain the outer query results. the results of this regression test may change
--upon implementation
--TODO: implement inner subquery constraints
SELECT * FROM cypher('subquery', $$ MATCH (a:person)
									WHERE EXISTS {
												  MATCH (a:person)
												  WHERE a.name = 'Takeshi'
												  RETURN a
												 }
									RETURN (a) $$) AS (result agtype);
                                              result                                               
---------------------------------------------------------------------------------------------------
 {"id": 844424930131969, "label": "person", "properties": {"age": 32, "name": "Briggite"}}::vertex
 {"id": 844424930131970, "label": "person", "properties": {"age": 28, "name": "Takeshi"}}::vertex
 {"id": 844424930131971, "label": "person", "properties": {"age": 25, "name": "Faye"}}::vertex
 {"id": 844424930131972, "label": "person", "properties": {"age": 34, "name": "Tony"}}::vertex
 {"id": 844424930131973, "label": "person", "properties": {"age": 33, "name": "Valerie"}}::vertex
 {"id": 844424930131974, "label": "person", "properties": {"age": 6, "name": "Calvin"}}::vertex
 {"id": 844424930131975, "label": "person", "properties": {"age": 8, "name": "Charlie"}}::vertex
(7 rows)

--query inside, with WHERE
SELECT * FROM cypher('subquery', $$ MATCH (a:person)
									WHERE EXISTS {MATCH (a:person)-[]->(b:pet)
												  WHERE b.name = 'Briggite'
												  RETURN b}
									RETURN (a) $$) AS (result agtype);
 result 
--------
(0 rows)

--no return
--EXISTS subquery is currently implemented with postgres subqueries, which do not
--constrain the outer query results. the results of this regression test may change
--upon implementation
--TODO: implement inner subquery constraints
SELECT * FROM cypher('subquery', $$ MATCH (a:person)
									WHERE EXISTS {MATCH (a:person)-[]->(b:pet)
												  WHERE a.name = 'Calvin'}
									RETURN (a) $$) AS (result agtype);
                                              result                                               
---------------------------------------------------------------------------------------------------
 {"id": 844424930131969, "label": "person", "properties": {"age": 32, "name": "Briggite"}}::vertex
 {"id": 844424930131970, "label": "person", "properties": {"age": 28, "name": "Takeshi"}}::vertex
 {"id": 844424930131971, "label": "person", "properties": {"age": 25, "name": "Faye"}}::vertex
 {"id": 844424930131972, "label": "person", "properties": {"age": 34, "name": "Tony"}}::vertex
 {"id": 844424930131973, "label": "person", "properties": {"age": 33, "name": "Valerie"}}::vertex
 {"id": 844424930131974, "label": "person", "properties": {"age": 6, "name": "Calvin"}}::vertex
 {"id": 844424930131975, "label": "person", "properties": {"age": 8, "name": "Charlie"}}::vertex
(7 rows)

--union
--EXISTS subquery is currently implemented with postgres subqueries, which do not
--constrain the outer query results. the results of this regression test may change
--upon implementation
--TODO: implement inner subquery constraints
SELECT * FROM cypher('subquery', $$ MATCH (a:person)
									WHERE EXISTS {
												  MATCH (a:person)-[]->(b:pet)
												  WHERE b.name = 'Hobbes'
												  RETURN b
												  UNION
												  MATCH (c:person)-[]->(d:person)
												  RETURN c
												 }
									RETURN (a) $$) AS (result agtype);
                                              result                                               
---------------------------------------------------------------------------------------------------
 {"id": 844424930131969, "label": "person", "properties": {"age": 32, "name": "Briggite"}}::vertex
 {"id": 844424930131970, "label": "person", "properties": {"age": 28, "name": "Takeshi"}}::vertex
 {"id": 844424930131971, "label": "person", "properties": {"age": 25, "name": "Faye"}}::vertex
 {"id": 844424930131972, "label": "person", "properties": {"age": 34, "name": "Tony"}}::vertex
 {"id": 844424930131973, "label": "person", "properties": {"age": 33, "name": "Valerie"}}::vertex
 {"id": 844424930131974, "label": "person", "properties": {"age": 6, "name": "Calvin"}}::vertex
 {"id": 844424930131975, "label": "person", "properties": {"age": 8, "name": "Charlie"}}::vertex
(7 rows)

-- union, mismatched var, should fail
SELECT * FROM cypher('subquery', $$ MATCH (a:person)
									WHERE EXISTS {
												  MATCH (a:person)-[]->(b:pet)
												  WHERE b.name = 'Snoopy'
												  RETURN c
												  UNION
												  MATCH (c:person)-[]->(d:person)
												  RETURN c
												 }
									RETURN (a) $$) AS (result agtype);
ERROR:  could not find rte for c
LINE 5:               RETURN c
                             ^
--union, no returns
SELECT * FROM cypher('subquery', $$ MATCH (a:person)
									WHERE EXISTS {
												  MATCH (a:person)-[]->(b:pet)
												  WHERE a.name = 'Charlie'
												  UNION
												  MATCH (c:person)-[]->(d:person)
												 }
									RETURN (a) $$) AS (result agtype);
                                              result                                               
---------------------------------------------------------------------------------------------------
 {"id": 844424930131969, "label": "person", "properties": {"age": 32, "name": "Briggite"}}::vertex
 {"id": 844424930131970, "label": "person", "properties": {"age": 28, "name": "Takeshi"}}::vertex
 {"id": 844424930131971, "label": "person", "properties": {"age": 25, "name": "Faye"}}::vertex
 {"id": 844424930131972, "label": "person", "properties": {"age": 34, "name": "Tony"}}::vertex
 {"id": 844424930131973, "label": "person", "properties": {"age": 33, "name": "Valerie"}}::vertex
 {"id": 844424930131974, "label": "person", "properties": {"age": 6, "name": "Calvin"}}::vertex
 {"id": 844424930131975, "label": "person", "properties": {"age": 8, "name": "Charlie"}}::vertex
(7 rows)

--union, mismatched returns, should fail
SELECT * FROM cypher('subquery', $$ MATCH (a:person)
									WHERE EXISTS {
												  MATCH (a:person)-[]->(b:pet)
												  WHERE a.name = 'Faye'
												  RETURN a
												  UNION
												  MATCH (c:person)-[]->(d:person)
												 }
									RETURN (a) $$) AS (result agtype);
ERROR:  syntax error at or near "}"
LINE 8:              }
                     ^
--nesting
--EXISTS subquery is currently implemented with postgres subqueries, which do not
--constrain the outer query results. the results of this regression test may change
--upon implementation
--TODO: implement inner subquery constraints
SELECT * FROM cypher('subquery', $$ MATCH (a:person)
									WHERE EXISTS {
												  MATCH (b:person)
												  WHERE EXISTS {
																MATCH (c:person)
																WHERE c.name = 'Takeshi'
																RETURN c
															   }
												 }
									RETURN (a) $$) AS (result agtype);
                                              result                                               
---------------------------------------------------------------------------------------------------
 {"id": 844424930131969, "label": "person", "properties": {"age": 32, "name": "Briggite"}}::vertex
 {"id": 844424930131970, "label": "person", "properties": {"age": 28, "name": "Takeshi"}}::vertex
 {"id": 844424930131971, "label": "person", "properties": {"age": 25, "name": "Faye"}}::vertex
 {"id": 844424930131972, "label": "person", "properties": {"age": 34, "name": "Tony"}}::vertex
 {"id": 844424930131973, "label": "person", "properties": {"age": 33, "name": "Valerie"}}::vertex
 {"id": 844424930131974, "label": "person", "properties": {"age": 6, "name": "Calvin"}}::vertex
 {"id": 844424930131975, "label": "person", "properties": {"age": 8, "name": "Charlie"}}::vertex
(7 rows)

--nesting, accessing var in outer scope
--EXISTS subquery is currently implemented with postgres subqueries, which do not
--constrain the outer query results. the results of this regression test may change
--upon implementation
--TODO: implement inner subquery constraints
SELECT * FROM cypher('subquery', $$ MATCH (a:person)
									WHERE EXISTS {
												  MATCH (b:person)
												  WHERE EXISTS {
																MATCH (c:person)
																WHERE b = c
																RETURN c
															   }
												 }
									RETURN (a) $$) AS (result agtype);
                                              result                                               
---------------------------------------------------------------------------------------------------
 {"id": 844424930131969, "label": "person", "properties": {"age": 32, "name": "Briggite"}}::vertex
 {"id": 844424930131970, "label": "person", "properties": {"age": 28, "name": "Takeshi"}}::vertex
 {"id": 844424930131971, "label": "person", "properties": {"age": 25, "name": "Faye"}}::vertex
 {"id": 844424930131972, "label": "person", "properties": {"age": 34, "name": "Tony"}}::vertex
 {"id": 844424930131973, "label": "person", "properties": {"age": 33, "name": "Valerie"}}::vertex
 {"id": 844424930131974, "label": "person", "properties": {"age": 6, "name": "Calvin"}}::vertex
 {"id": 844424930131975, "label": "person", "properties": {"age": 8, "name": "Charlie"}}::vertex
(7 rows)

--nesting, accessing indirection in outer scope
--EXISTS subquery is currently implemented with postgres subqueries, which do not
--constrain the outer query results. the results of this regression test may change
--upon implementation
--TODO: implement inner subquery constraints
SELECT * FROM cypher('subquery', $$ MATCH (a:person)
										   WHERE EXISTS {
														 MATCH (b:person)
														 WHERE EXISTS {
																	   MATCH (c:person)
																	   WHERE b.name = 'Takeshi'
																	   RETURN c
																	  }
														}
										   RETURN (a) $$) AS (result agtype);
                                              result                                               
---------------------------------------------------------------------------------------------------
 {"id": 844424930131969, "label": "person", "properties": {"age": 32, "name": "Briggite"}}::vertex
 {"id": 844424930131970, "label": "person", "properties": {"age": 28, "name": "Takeshi"}}::vertex
 {"id": 844424930131971, "label": "person", "properties": {"age": 25, "name": "Faye"}}::vertex
 {"id": 844424930131972, "label": "person", "properties": {"age": 34, "name": "Tony"}}::vertex
 {"id": 844424930131973, "label": "person", "properties": {"age": 33, "name": "Valerie"}}::vertex
 {"id": 844424930131974, "label": "person", "properties": {"age": 6, "name": "Calvin"}}::vertex
 {"id": 844424930131975, "label": "person", "properties": {"age": 8, "name": "Charlie"}}::vertex
(7 rows)

--nesting, accessing var 2+ levels up
--EXISTS subquery is currently implemented with postgres subqueries, which do not
--constrain the outer query results. the results of this regression test may change
--upon implementation
--TODO: implement inner subquery constraints
SELECT * FROM cypher('subquery', $$ MATCH (a:person)
										   WHERE EXISTS {
														 MATCH (b:person)
														 WHERE EXISTS {
																	   MATCH (c:person)
																	   WHERE a.name = 'Takeshi'
																	   RETURN c
																	  }
														}
										   RETURN (a) $$) AS (result agtype);
                                              result                                               
---------------------------------------------------------------------------------------------------
 {"id": 844424930131969, "label": "person", "properties": {"age": 32, "name": "Briggite"}}::vertex
 {"id": 844424930131970, "label": "person", "properties": {"age": 28, "name": "Takeshi"}}::vertex
 {"id": 844424930131971, "label": "person", "properties": {"age": 25, "name": "Faye"}}::vertex
 {"id": 844424930131972, "label": "person", "properties": {"age": 34, "name": "Tony"}}::vertex
 {"id": 844424930131973, "label": "person", "properties": {"age": 33, "name": "Valerie"}}::vertex
 {"id": 844424930131974, "label": "person", "properties": {"age": 6, "name": "Calvin"}}::vertex
 {"id": 844424930131975, "label": "person", "properties": {"age": 8, "name": "Charlie"}}::vertex
(7 rows)

--nesting, accessing indirection 2+ levels up
--EXISTS subquery is currently implemented with postgres subqueries, which do not
--constrain the outer query results. the results of this regression test may change
--upon implementation
--TODO: implement inner subquery constraints
SELECT * FROM cypher('subquery', $$ MATCH (a:person)
									WHERE EXISTS {
												  MATCH (b:person)
												  WHERE EXISTS {
																MATCH (c:person)
																WHERE a = b
																RETURN c
															  }
												}
									RETURN (a) $$) AS (result agtype);
                                              result                                               
---------------------------------------------------------------------------------------------------
 {"id": 844424930131969, "label": "person", "properties": {"age": 32, "name": "Briggite"}}::vertex
 {"id": 844424930131970, "label": "person", "properties": {"age": 28, "name": "Takeshi"}}::vertex
 {"id": 844424930131971, "label": "person", "properties": {"age": 25, "name": "Faye"}}::vertex
 {"id": 844424930131972, "label": "person", "properties": {"age": 34, "name": "Tony"}}::vertex
 {"id": 844424930131973, "label": "person", "properties": {"age": 33, "name": "Valerie"}}::vertex
 {"id": 844424930131974, "label": "person", "properties": {"age": 6, "name": "Calvin"}}::vertex
 {"id": 844424930131975, "label": "person", "properties": {"age": 8, "name": "Charlie"}}::vertex
(7 rows)

--EXISTS outside of WHERE
SELECT * FROM cypher('subquery', $$ MATCH (a:person)
									RETURN a, EXISTS {(a:person)-[]->(:pet)}
									$$) AS (a agtype, exists agtype);
                                                 a                                                 | exists 
---------------------------------------------------------------------------------------------------+--------
 {"id": 844424930131969, "label": "person", "properties": {"age": 32, "name": "Briggite"}}::vertex | false
 {"id": 844424930131970, "label": "person", "properties": {"age": 28, "name": "Takeshi"}}::vertex  | false
 {"id": 844424930131971, "label": "person", "properties": {"age": 25, "name": "Faye"}}::vertex     | false
 {"id": 844424930131972, "label": "person", "properties": {"age": 34, "name": "Tony"}}::vertex     | false
 {"id": 844424930131973, "label": "person", "properties": {"age": 33, "name": "Valerie"}}::vertex  | false
 {"id": 844424930131974, "label": "person", "properties": {"age": 6, "name": "Calvin"}}::vertex    | true
 {"id": 844424930131975, "label": "person", "properties": {"age": 8, "name": "Charlie"}}::vertex   | true
(7 rows)

--Var doesnt exist in outside scope, should fail
SELECT * FROM cypher('subquery', $$ RETURN 1,
										   EXISTS {
												   MATCH (b:person)-[]->(:pet)
												   RETURN a
												  }
									$$) AS (a agtype, exists agtype);
ERROR:  could not find rte for a
LINE 4:                RETURN a
                              ^
--- COUNT
--count pattern subquery in where
SELECT * FROM cypher('subquery', $$ MATCH (a:person)
									WHERE COUNT {(a:person)} > 1
									RETURN (a) $$) AS (result agtype);
                                              result                                               
---------------------------------------------------------------------------------------------------
 {"id": 844424930131969, "label": "person", "properties": {"age": 32, "name": "Briggite"}}::vertex
 {"id": 844424930131970, "label": "person", "properties": {"age": 28, "name": "Takeshi"}}::vertex
 {"id": 844424930131971, "label": "person", "properties": {"age": 25, "name": "Faye"}}::vertex
 {"id": 844424930131972, "label": "person", "properties": {"age": 34, "name": "Tony"}}::vertex
 {"id": 844424930131973, "label": "person", "properties": {"age": 33, "name": "Valerie"}}::vertex
 {"id": 844424930131974, "label": "person", "properties": {"age": 6, "name": "Calvin"}}::vertex
 {"id": 844424930131975, "label": "person", "properties": {"age": 8, "name": "Charlie"}}::vertex
(7 rows)

--count pattern in return
SELECT * FROM cypher('subquery', $$ MATCH (a:person)
									RETURN COUNT{(a)-[]->(:pet)} $$) AS (result agtype);
 result 
--------
 0
 0
 0
 0
 0
 1
 1
(7 rows)

--count pattern with WHERE
SELECT * FROM cypher('subquery', $$ MATCH (a:person)
									RETURN COUNT{(a)-[]->(b:pet) WHERE b.name = 'Hobbes'} $$) AS (result agtype);
 result 
--------
 0
 0
 0
 0
 0
 1
 0
(7 rows)

--solo match in where
--COUNT subquery is currently implemented with postgres subqueries, which do not
--constrain the outer query results. the results of this regression test may change
--upon implementation
--TODO: implement inner subquery constraints
SELECT * FROM cypher('subquery', $$ MATCH (a:person)
									WHERE COUNT{MATCH (a:person)-[]-(:pet)} > 1 RETURN a $$) AS (result agtype);
                                              result                                               
---------------------------------------------------------------------------------------------------
 {"id": 844424930131969, "label": "person", "properties": {"age": 32, "name": "Briggite"}}::vertex
 {"id": 844424930131970, "label": "person", "properties": {"age": 28, "name": "Takeshi"}}::vertex
 {"id": 844424930131971, "label": "person", "properties": {"age": 25, "name": "Faye"}}::vertex
 {"id": 844424930131972, "label": "person", "properties": {"age": 34, "name": "Tony"}}::vertex
 {"id": 844424930131973, "label": "person", "properties": {"age": 33, "name": "Valerie"}}::vertex
 {"id": 844424930131974, "label": "person", "properties": {"age": 6, "name": "Calvin"}}::vertex
 {"id": 844424930131975, "label": "person", "properties": {"age": 8, "name": "Charlie"}}::vertex
(7 rows)

--solo match in return
SELECT * FROM cypher('subquery', $$ MATCH (a:person)
									RETURN COUNT{MATCH (a)} $$) AS (result agtype);
 result 
--------
 1
 1
 1
 1
 1
 1
 1
(7 rows)

--match return in where
--COUNT subquery is currently implemented with postgres subqueries, which do not
--constrain the outer query results. the results of this regression test may change
--upon implementation
--TODO: implement inner subquery constraints
SELECT * FROM cypher('subquery', $$ MATCH (a:person)
									WHERE COUNT{MATCH (a) RETURN a} > 1 RETURN a $$) AS (result agtype);
                                              result                                               
---------------------------------------------------------------------------------------------------
 {"id": 844424930131969, "label": "person", "properties": {"age": 32, "name": "Briggite"}}::vertex
 {"id": 844424930131970, "label": "person", "properties": {"age": 28, "name": "Takeshi"}}::vertex
 {"id": 844424930131971, "label": "person", "properties": {"age": 25, "name": "Faye"}}::vertex
 {"id": 844424930131972, "label": "person", "properties": {"age": 34, "name": "Tony"}}::vertex
 {"id": 844424930131973, "label": "person", "properties": {"age": 33, "name": "Valerie"}}::vertex
 {"id": 844424930131974, "label": "person", "properties": {"age": 6, "name": "Calvin"}}::vertex
 {"id": 844424930131975, "label": "person", "properties": {"age": 8, "name": "Charlie"}}::vertex
(7 rows)

--match return in return
SELECT * FROM cypher('subquery', $$ MATCH (a:person)
									RETURN COUNT{MATCH (a) RETURN a} $$) AS (result agtype);
 result 
--------
 1
 1
 1
 1
 1
 1
 1
(7 rows)

--match where return
SELECT * FROM cypher('subquery', $$ MATCH (a:person)
									RETURN COUNT{MATCH (a)
												 WHERE a.age > 25
												 RETURN a} $$) AS (result agtype);
 result 
--------
 1
 1
 0
 1
 1
 0
 0
(7 rows)

--counting number of relationships per node
SELECT * FROM cypher('subquery', $$ MATCH (a:person)
									RETURN a.name, COUNT{(a)-[]-()} $$) AS (name agtype, count agtype);
    name    | count 
------------+-------
 "Briggite" | 1
 "Takeshi"  | 1
 "Faye"     | 1
 "Tony"     | 2
 "Valerie"  | 1
 "Calvin"   | 1
 "Charlie"  | 1
(7 rows)

--nested counts
SELECT * FROM cypher('subquery', $$ MATCH (a:person)
									RETURN a.name, COUNT{MATCH (a) WHERE COUNT {MATCH (a) WHERE a.age < 23 RETURN a } > 0 } $$) AS (name agtype, count agtype);
    name    | count 
------------+-------
 "Briggite" | 0
 "Takeshi"  | 0
 "Faye"     | 0
 "Tony"     | 0
 "Valerie"  | 0
 "Calvin"   | 1
 "Charlie"  | 1
(7 rows)

--incorrect variable reference
SELECT * FROM cypher('subquery', $$ MATCH (a:person)
									RETURN a.name, COUNT{MATCH (a) RETURN b} $$) AS (name agtype, count agtype);
ERROR:  could not find rte for b
LINE 2:          RETURN a.name, COUNT{MATCH (a) RETURN b} $$) AS (na...
                                                       ^
--incorrect nested variable reference
SELECT * FROM cypher('subquery', $$ MATCH (a:person)
									RETURN a.name, COUNT{MATCH (a) WHERE COUNT {MATCH (b) RETURN b } > 1 RETURN b} $$) AS (name agtype count agtype);
ERROR:  syntax error at or near "count"
LINE 2: ... (b) RETURN b } > 1 RETURN b} $$) AS (name agtype count agty...
                                                             ^
--count nested with exists
SELECT * FROM cypher('subquery', $$ MATCH (a:person)
									RETURN a.name, COUNT{MATCH (a) WHERE EXISTS {MATCH (a) RETURN a }} $$) AS (name agtype, count agtype);
    name    | count 
------------+-------
 "Briggite" | 1
 "Takeshi"  | 1
 "Faye"     | 1
 "Tony"     | 1
 "Valerie"  | 1
 "Calvin"   | 1
 "Charlie"  | 1
(7 rows)

--
-- Cleanup
--
SELECT * FROM drop_graph('subquery', true);
NOTICE:  drop cascades to 6 other objects
DETAIL:  drop cascades to table subquery._ag_label_vertex
drop cascades to table subquery._ag_label_edge
drop cascades to table subquery.person
drop cascades to table subquery.knows
drop cascades to table subquery.loved
drop cascades to table subquery.pet
NOTICE:  graph "subquery" has been dropped
 drop_graph 
------------
 
(1 row)

--
-- End of tests
--
