/*
 * Licensed to the Apache Software Foundation (ASF) under one
 * or more contributor license agreements.  See the NOTICE file
 * distributed with this work for additional information
 * regarding copyright ownership.  The ASF licenses this file
 * to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance
 * with the License.  You may obtain a copy of the License at
 *
 * http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing,
 * software distributed under the License is distributed on an
 * "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
 * KIND, either express or implied.  See the License for the
 * specific language governing permissions and limitations
 * under the License.
 */
LOAD 'age';
SET search_path TO ag_catalog;
/*
 * MATCH OR Expression (Vertex)
 *
 * TODO: All labels are mutually exclusive. When CREATE for multiple label is
 * implemented write tests for mutually-inclusive MATCHes.
 */
 -- create
SELECT create_graph('multiple-label-1');
NOTICE:  graph "multiple-label-1" has been created
 create_graph 
--------------
 
(1 row)

SELECT * FROM cypher('multiple-label-1', $$ CREATE (v:A{name:'A1'}) RETURN v $$) as (a agtype);
                                      a                                      
-----------------------------------------------------------------------------
 {"id": 844424930131969, "label": "A", "properties": {"name": "A1"}}::vertex
(1 row)

SELECT * FROM cypher('multiple-label-1', $$ CREATE (v:A{name:'A2'}) RETURN v $$) as (a agtype);
                                      a                                      
-----------------------------------------------------------------------------
 {"id": 844424930131970, "label": "A", "properties": {"name": "A2"}}::vertex
(1 row)

SELECT * FROM cypher('multiple-label-1', $$ CREATE (v:B{name:'B1'}) RETURN v $$) as (a agtype);
                                      a                                       
------------------------------------------------------------------------------
 {"id": 1125899906842625, "label": "B", "properties": {"name": "B1"}}::vertex
(1 row)

SELECT * FROM cypher('multiple-label-1', $$ CREATE (v:B{name:'B2'}) RETURN v $$) as (a agtype);
                                      a                                       
------------------------------------------------------------------------------
 {"id": 1125899906842626, "label": "B", "properties": {"name": "B2"}}::vertex
(1 row)

SELECT * FROM cypher('multiple-label-1', $$ CREATE (v:C{name:'C1'}) RETURN v $$) as (a agtype);
                                      a                                       
------------------------------------------------------------------------------
 {"id": 1407374883553281, "label": "C", "properties": {"name": "C1"}}::vertex
(1 row)

SELECT * FROM cypher('multiple-label-1', $$ CREATE (v:C{name:'C2'}) RETURN v $$) as (a agtype);
                                      a                                       
------------------------------------------------------------------------------
 {"id": 1407374883553282, "label": "C", "properties": {"name": "C2"}}::vertex
(1 row)

SELECT * FROM cypher('multiple-label-1', $$ CREATE (v:D{name:'D1'}) RETURN v $$) as (a agtype);
                                      a                                       
------------------------------------------------------------------------------
 {"id": 1688849860263937, "label": "D", "properties": {"name": "D1"}}::vertex
(1 row)

SELECT * FROM cypher('multiple-label-1', $$ CREATE (v:D{name:'D2'}) RETURN v $$) as (a agtype);
                                      a                                       
------------------------------------------------------------------------------
 {"id": 1688849860263938, "label": "D", "properties": {"name": "D2"}}::vertex
(1 row)

-- general match
SELECT * FROM cypher('multiple-label-1', $$ MATCH (v) RETURN v $$) as (a agtype);
                                      a                                       
------------------------------------------------------------------------------
 {"id": 844424930131969, "label": "A", "properties": {"name": "A1"}}::vertex
 {"id": 844424930131970, "label": "A", "properties": {"name": "A2"}}::vertex
 {"id": 1125899906842625, "label": "B", "properties": {"name": "B1"}}::vertex
 {"id": 1125899906842626, "label": "B", "properties": {"name": "B2"}}::vertex
 {"id": 1407374883553281, "label": "C", "properties": {"name": "C1"}}::vertex
 {"id": 1407374883553282, "label": "C", "properties": {"name": "C2"}}::vertex
 {"id": 1688849860263937, "label": "D", "properties": {"name": "D1"}}::vertex
 {"id": 1688849860263938, "label": "D", "properties": {"name": "D2"}}::vertex
(8 rows)

SELECT * FROM cypher('multiple-label-1', $$ MATCH (v:A) RETURN v.name $$) as (a agtype);
  a   
------
 "A1"
 "A2"
(2 rows)

SELECT * FROM cypher('multiple-label-1', $$ MATCH (v:A|B) RETURN v.name $$) as (a agtype);
  a   
------
 "A1"
 "A2"
 "B1"
 "B2"
(4 rows)

SELECT * FROM cypher('multiple-label-1', $$ MATCH (v:A|B|C) RETURN v.name $$) as (a agtype);
  a   
------
 "A1"
 "A2"
 "B1"
 "B2"
 "C1"
 "C2"
(6 rows)

SELECT * FROM cypher('multiple-label-1', $$ MATCH (v:A|B|C|D) RETURN v.name $$) as (a agtype);
  a   
------
 "A1"
 "A2"
 "B1"
 "B2"
 "C1"
 "C2"
 "D1"
 "D2"
(8 rows)

-- duplicate (should output same as MATCH (v:A|B))
SELECT * FROM cypher('multiple-label-1', $$ MATCH (v:A|B|A) RETURN v.name $$) as (a agtype);
  a   
------
 "A1"
 "A2"
 "B1"
 "B2"
(4 rows)

-- different order (should output same as MATCH (v:A|B))
SELECT * FROM cypher('multiple-label-1', $$ MATCH (v:B|A) RETURN v.name $$) as (a agtype);
  a   
------
 "A1"
 "A2"
 "B1"
 "B2"
(4 rows)

-- label M does not exists (should output same as MATCH (v:A|B))
SELECT * FROM cypher('multiple-label-1', $$ MATCH (v:A|B|M) RETURN v.name $$) as (a agtype);
  a   
------
 "A1"
 "A2"
 "B1"
 "B2"
(4 rows)

-- no label exists (should output empty)
SELECT * FROM cypher('multiple-label-1', $$ MATCH (v:M|N|O) RETURN v.name $$) as (a agtype);
 a 
---
(0 rows)

-- cleanup
SELECT drop_graph('multiple-label-1', true);
NOTICE:  drop cascades to 6 other objects
DETAIL:  drop cascades to table "multiple-label-1"._ag_label_vertex
drop cascades to table "multiple-label-1"._ag_label_edge
drop cascades to table "multiple-label-1"."A"
drop cascades to table "multiple-label-1"."B"
drop cascades to table "multiple-label-1"."C"
drop cascades to table "multiple-label-1"."D"
NOTICE:  graph "multiple-label-1" has been dropped
 drop_graph 
------------
 
(1 row)

/*
 * MATCH OR Expression (Edge)
 */
 -- create
SELECT create_graph('multiple-label-2');
NOTICE:  graph "multiple-label-2" has been created
 create_graph 
--------------
 
(1 row)

SELECT * FROM cypher('multiple-label-2', $$ CREATE ({name:'a1'})-[e:A]->({name:'a2'}) RETURN e $$) as (a agtype);
                                                           a                                                           
-----------------------------------------------------------------------------------------------------------------------
 {"id": 844424930131969, "label": "A", "end_id": 281474976710658, "start_id": 281474976710657, "properties": {}}::edge
(1 row)

SELECT * FROM cypher('multiple-label-2', $$ CREATE ({name:'b1'})-[e:B]->({name:'b2'}) RETURN e $$) as (a agtype);
                                                           a                                                            
------------------------------------------------------------------------------------------------------------------------
 {"id": 1125899906842625, "label": "B", "end_id": 281474976710660, "start_id": 281474976710659, "properties": {}}::edge
(1 row)

SELECT * FROM cypher('multiple-label-2', $$ CREATE ({name:'c1'})-[e:C]->({name:'c2'}) RETURN e $$) as (a agtype);
                                                           a                                                            
------------------------------------------------------------------------------------------------------------------------
 {"id": 1407374883553281, "label": "C", "end_id": 281474976710662, "start_id": 281474976710661, "properties": {}}::edge
(1 row)

-- general match
SELECT * FROM cypher('multiple-label-2', $$ MATCH (x)-[e]->(y) RETURN x.name, y.name, e $$) as (x agtype, y agtype, e agtype);
  x   |  y   |                                                           e                                                            
------+------+------------------------------------------------------------------------------------------------------------------------
 "a1" | "a2" | {"id": 844424930131969, "label": "A", "end_id": 281474976710658, "start_id": 281474976710657, "properties": {}}::edge
 "b1" | "b2" | {"id": 1125899906842625, "label": "B", "end_id": 281474976710660, "start_id": 281474976710659, "properties": {}}::edge
 "c1" | "c2" | {"id": 1407374883553281, "label": "C", "end_id": 281474976710662, "start_id": 281474976710661, "properties": {}}::edge
(3 rows)

SELECT * FROM cypher('multiple-label-2', $$ MATCH (x)-[:A]->(y) RETURN x.name, y.name $$) as (x agtype, y agtype);
  x   |  y   
------+------
 "a1" | "a2"
(1 row)

SELECT * FROM cypher('multiple-label-2', $$ MATCH (x)-[:A|B]->(y) RETURN x.name, y.name $$) as (x agtype, y agtype);
  x   |  y   
------+------
 "a1" | "a2"
 "b1" | "b2"
(2 rows)

SELECT * FROM cypher('multiple-label-2', $$ MATCH (x)-[:A|B|C]->(y) RETURN x.name, y.name $$) as (x agtype, y agtype);
  x   |  y   
------+------
 "a1" | "a2"
 "b1" | "b2"
 "c1" | "c2"
(3 rows)

-- duplicate (should output same as MATCH (x)-[:A|B]->(y))
SELECT * FROM cypher('multiple-label-2', $$ MATCH (x)-[:A|B|A]->(y) RETURN x.name, y.name $$) as (x agtype, y agtype);
  x   |  y   
------+------
 "a1" | "a2"
 "b1" | "b2"
(2 rows)

-- different order (should output same as MATCH (x)-[:A|B]->(y))
SELECT * FROM cypher('multiple-label-2', $$ MATCH (x)-[:B|A]->(y) RETURN x.name, y.name $$) as (x agtype, y agtype);
  x   |  y   
------+------
 "a1" | "a2"
 "b1" | "b2"
(2 rows)

-- label M does not exists (should output same as MATCH (x)-[:A|B]->(y))
SELECT * FROM cypher('multiple-label-2', $$ MATCH (x)-[:A|B|M]->(y) RETURN x.name, y.name $$) as (x agtype, y agtype);
  x   |  y   
------+------
 "a1" | "a2"
 "b1" | "b2"
(2 rows)

-- no label exists (should output empty)
SELECT * FROM cypher('multiple-label-2', $$ MATCH (x)-[:M|N|O]->(y) RETURN x.name, y.name $$) as (x agtype, y agtype);
 x | y 
---+---
(0 rows)

-- cleanup
SELECT drop_graph('multiple-label-2', true);
NOTICE:  drop cascades to 5 other objects
DETAIL:  drop cascades to table "multiple-label-2"._ag_label_vertex
drop cascades to table "multiple-label-2"._ag_label_edge
drop cascades to table "multiple-label-2"."A"
drop cascades to table "multiple-label-2"."B"
drop cascades to table "multiple-label-2"."C"
NOTICE:  graph "multiple-label-2" has been dropped
 drop_graph 
------------
 
(1 row)

